{"version":"1.0","truncation":null,"padding":{"strategy":"BatchLongest","direction":"Right","pad_to_multiple_of":null,"pad_id":0,"pad_type_id":0,"pad_token":"<pad>"},"added_tokens":[{"id":0,"special":true,"content":"<pad>","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":1,"special":true,"content":"<s>","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":2,"special":true,"content":"</s>","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":3,"special":true,"content":"<unk>","single_word":false,"lstrip":false,"rstrip":false,"normalized":false}],"normalizer":null,"pre_tokenizer":{"type":"Whitespace"},"post_processor":{"type":"TemplateProcessing","single":[{"SpecialToken":{"id":"<s>","type_id":0}},{"Sequence":{"id":"A","type_id":0}},{"SpecialToken":{"id":"</s>","type_id":0}}],"pair":[{"Sequence":{"id":"A","type_id":0}},{"Sequence":{"id":"B","type_id":1}}],"special_tokens":{"</s>":{"id":"</s>","ids":[2],"tokens":["</s>"]},"<s>":{"id":"<s>","ids":[1],"tokens":["<s>"]}}},"decoder":null,"model":{"dropout":null,"unk_token":null,"continuing_subword_prefix":null,"end_of_word_suffix":null,"fuse_unk":false,"vocab":{"<pad>":0,"<s>":1,"</s>":2,"<unk>":3,"a":4,"b":5,"c":6,"d":7,"e":8,"f":9,"g":10,"h":11,"i":12,"j":13,"k":14,"l":15,"m":16,"n":17,"o":18,"p":19,"q":20,"r":21,"s":22,"t":23,"u":24,"v":25,"w":26,"x":27,"y":28,"z":29,"th":30,"aa":31,"al":32,"an":33,"ai":34,"ar":35,"ath":36,"in":37,"ir":38,"il":39,"am":40,"kk":41,"um":42,"pa":43,"iy":44,"tt":45,"kal":46,"dh":47,"ch":48,"gal":49,"av":50,"oo":51,"aan":52,"thth":53,"ap":54,"aiy":55,"er":56,"du":57,"aar":58,"ur":59,"ka":60,"zh":61,"un":62,"tr":63},"merges":["t h","a a","a l","a n","a i","a r","a th","i n","i r","i l","a m","k k","u m","p a","i y","t t","k al","d h","c h","g al","a v","o o","aa n","th th","a p","ai y","e r","d u","aa r","u r","k a","z h","u n","t r"]}}