{"version":"1.0","truncation":null,"padding":{"strategy":"BatchLongest","direction":"Right","pad_to_multiple_of":null,"pad_id":0,"pad_type_id":0,"pad_token":"<pad>"},"added_tokens":[{"id":0,"special":true,"content":"<pad>","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":1,"special":true,"content":"<s>","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":2,"special":true,"content":"</s>","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":3,"special":true,"content":"<unk>","single_word":false,"lstrip":false,"rstrip":false,"normalized":false}],"normalizer":null,"pre_tokenizer":{"type":"Whitespace"},"post_processor":{"type":"TemplateProcessing","single":[{"SpecialToken":{"id":"<s>","type_id":0}},{"Sequence":{"id":"A","type_id":0}},{"SpecialToken":{"id":"</s>","type_id":0}}],"pair":[{"Sequence":{"id":"A","type_id":0}},{"Sequence":{"id":"B","type_id":1}}],"special_tokens":{"</s>":{"id":"</s>","ids":[2],"tokens":["</s>"]},"<s>":{"id":"<s>","ids":[1],"tokens":["<s>"]}}},"decoder":null,"model":{"dropout":null,"unk_token":null,"continuing_subword_prefix":null,"end_of_word_suffix":null,"fuse_unk":false,"vocab":{"<pad>":0,"<s>":1,"</s>":2,"<unk>":3,"ஃ":4,"அ":5,"ஆ":6,"இ":7,"ஈ":8,"உ":9,"ஊ":10,"எ":11,"ஏ":12,"ஐ":13,"ஒ":14,"ஓ":15,"க":16,"ங":17,"ச":18,"ஜ":19,"ஞ":20,"ட":21,"ண":22,"த":23,"ந":24,"ன":25,"ப":26,"ம":27,"ய":28,"ர":29,"ற":30,"ல":31,"ள":32,"ழ":33,"வ":34,"ஷ":35,"ஸ":36,"ஹ":37,"ா":38,"ி":39,"ீ":40,"ு":41,"ூ":42,"ெ":43,"ே":44,"ை":45,"ொ":46,"ோ":47,"ௌ":48,"்":49},"merges":[]}}