{"version":"1.0","truncation":null,"padding":{"strategy":"BatchLongest","direction":"Right","pad_to_multiple_of":null,"pad_id":0,"pad_type_id":0,"pad_token":"<pad>"},"added_tokens":[{"id":0,"special":true,"content":"<pad>","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":1,"special":true,"content":"<s>","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":2,"special":true,"content":"</s>","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":3,"special":true,"content":"<unk>","single_word":false,"lstrip":false,"rstrip":false,"normalized":false}],"normalizer":null,"pre_tokenizer":{"type":"Whitespace"},"post_processor":{"type":"TemplateProcessing","single":[{"SpecialToken":{"id":"<s>","type_id":0}},{"Sequence":{"id":"A","type_id":0}},{"SpecialToken":{"id":"</s>","type_id":0}}],"pair":[{"Sequence":{"id":"A","type_id":0}},{"Sequence":{"id":"B","type_id":1}}],"special_tokens":{"</s>":{"id":"</s>","ids":[2],"tokens":["</s>"]},"<s>":{"id":"<s>","ids":[1],"tokens":["<s>"]}}},"decoder":null,"model":{"dropout":null,"unk_token":null,"continuing_subword_prefix":null,"end_of_word_suffix":null,"fuse_unk":false,"vocab":{"<pad>":0,"<s>":1,"</s>":2,"<unk>":3,"ం":4,"ః":5,"అ":6,"ఆ":7,"ఇ":8,"ఈ":9,"ఉ":10,"ఊ":11,"ఋ":12,"ఎ":13,"ఏ":14,"ఐ":15,"ఒ":16,"ఓ":17,"ఔ":18,"క":19,"ఖ":20,"గ":21,"ఘ":22,"చ":23,"ఛ":24,"జ":25,"ఝ":26,"ఞ":27,"ట":28,"ఠ":29,"డ":30,"ఢ":31,"ణ":32,"త":33,"థ":34,"ద":35,"ధ":36,"న":37,"ప":38,"ఫ":39,"బ":40,"భ":41,"మ":42,"య":43,"ర":44,"ఱ":45,"ల":46,"ళ":47,"వ":48,"శ":49,"ష":50,"స":51,"హ":52,"ా":53,"ి":54,"ీ":55,"ు":56,"ూ":57,"ృ":58,"ె":59,"ే":60,"ై":61,"ొ":62,"ో":63,"ౌ":64,"్":65},"merges":[]}}