{"version":"1.0","truncation":null,"padding":{"strategy":"BatchLongest","direction":"Right","pad_to_multiple_of":null,"pad_id":0,"pad_type_id":0,"pad_token":"<pad>"},"added_tokens":[{"id":0,"special":true,"content":"<pad>","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":1,"special":true,"content":"<s>","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":2,"special":true,"content":"</s>","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":3,"special":true,"content":"<unk>","single_word":false,"lstrip":false,"rstrip":false,"normalized":false}],"normalizer":null,"pre_tokenizer":{"type":"Whitespace"},"post_processor":{"type":"TemplateProcessing","single":[{"SpecialToken":{"id":"<s>","type_id":0}},{"Sequence":{"id":"A","type_id":0}},{"SpecialToken":{"id":"</s>","type_id":0}}],"pair":[{"Sequence":{"id":"A","type_id":0}},{"Sequence":{"id":"B","type_id":1}}],"special_tokens":{"</s>":{"id":"</s>","ids":[2],"tokens":["</s>"]},"<s>":{"id":"<s>","ids":[1],"tokens":["<s>"]}}},"decoder":null,"model":{"dropout":null,"unk_token":null,"continuing_subword_prefix":null,"end_of_word_suffix":null,"fuse_unk":false,"vocab":{"<pad>":0,"<s>":1,"</s>":2,"<unk>":3,"ँ":4,"ं":5,"ः":6,"अ":7,"आ":8,"इ":9,"ई":10,"उ":11,"ऊ":12,"ऋ":13,"ए":14,"ऐ":15,"ऑ":16,"ओ":17,"औ":18,"क":19,"ख":20,"ग":21,"घ":22,"ङ":23,"च":24,"छ":25,"ज":26,"झ":27,"ञ":28,"ट":29,"ठ":30,"ड":31,"ढ":32,"ण":33,"त":34,"थ":35,"द":36,"ध":37,"न":38,"प":39,"फ":40,"ब":41,"भ":42,"म":43,"य":44,"र":45,"ल":46,"व":47,"श":48,"ष":49,"स":50,"ह":51,"़":52,"ा":53,"ि":54,"ी":55,"ु":56,"ू":57,"ृ":58,"ॅ":59,"े":60,"ै":61,"ॉ":62,"ो":63,"ौ":64,"्":65,"ॐ":66},"merges":[]}}