{"version":"1.0","truncation":null,"padding":{"strategy":"BatchLongest","direction":"Right","pad_to_multiple_of":null,"pad_id":0,"pad_type_id":0,"pad_token":"<pad>"},"added_tokens":[{"id":0,"special":true,"content":"<pad>","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":1,"special":true,"content":"<s>","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":2,"special":true,"content":"</s>","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":3,"special":true,"content":"<unk>","single_word":false,"lstrip":false,"rstrip":false,"normalized":false}],"normalizer":null,"pre_tokenizer":{"type":"Whitespace"},"post_processor":{"type":"TemplateProcessing","single":[{"SpecialToken":{"id":"<s>","type_id":0}},{"Sequence":{"id":"A","type_id":0}},{"SpecialToken":{"id":"</s>","type_id":0}}],"pair":[{"Sequence":{"id":"A","type_id":0}},{"Sequence":{"id":"B","type_id":1}}],"special_tokens":{"</s>":{"id":"</s>","ids":[2],"tokens":["</s>"]},"<s>":{"id":"<s>","ids":[1],"tokens":["<s>"]}}},"decoder":null,"model":{"dropout":null,"unk_token":null,"continuing_subword_prefix":null,"end_of_word_suffix":null,"fuse_unk":false,"vocab":{"<pad>":0,"<s>":1,"</s>":2,"<unk>":3,"a":4,"b":5,"c":6,"d":7,"e":8,"f":9,"g":10,"h":11,"i":12,"j":13,"k":14,"l":15,"m":16,"n":17,"o":18,"p":19,"q":20,"r":21,"s":22,"t":23,"u":24,"v":25,"w":26,"x":27,"y":28,"z":29,"an":30,"ar":31,"al":32,"ad":33,"ag":34,"av":35,"ha":36,"is":37,"at":38,"id":39,"ya":40,"ra":41,"it":42,"ann":43,"in":44,"as":45,"ut":46,"ada":47,"annu":48,"all":49,"am":50,"ak":51,"sh":52,"th":53,"ig":54,"ik":55,"uv":56,"oo":57,"agal":58,"alli":59,"agi":60,"utt":61,"ch":62,"da":63},"merges":["a n","a r","a l","a d","a g","a v","h a","i s","a t","i d","y a","r a","i t","an n","i n","a s","u t","ad a","ann u","al l","a m","a k","s h","t h","i g","i k","u v","o o","ag al","all i","ag i","ut t","c h","d a"]}}