{"version":"1.0","truncation":null,"padding":{"strategy":"BatchLongest","direction":"Right","pad_to_multiple_of":null,"pad_id":0,"pad_type_id":0,"pad_token":"<pad>"},"added_tokens":[{"id":0,"special":true,"content":"<pad>","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":1,"special":true,"content":"<s>","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":2,"special":true,"content":"</s>","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":3,"special":true,"content":"<unk>","single_word":false,"lstrip":false,"rstrip":false,"normalized":false}],"normalizer":null,"pre_tokenizer":{"type":"Whitespace"},"post_processor":{"type":"TemplateProcessing","single":[{"SpecialToken":{"id":"<s>","type_id":0}},{"Sequence":{"id":"A","type_id":0}},{"SpecialToken":{"id":"</s>","type_id":0}}],"pair":[{"Sequence":{"id":"A","type_id":0}},{"Sequence":{"id":"B","type_id":1}}],"special_tokens":{"</s>":{"id":"</s>","ids":[2],"tokens":["</s>"]},"<s>":{"id":"<s>","ids":[1],"tokens":["<s>"]}}},"decoder":null,"model":{"dropout":null,"unk_token":null,"continuing_subword_prefix":null,"end_of_word_suffix":null,"fuse_unk":false,"vocab":{"<pad>":0,"<s>":1,"</s>":2,"<unk>":3,"ಂ":4,"ಃ":5,"ಅ":6,"ಆ":7,"ಇ":8,"ಈ":9,"ಉ":10,"ಊ":11,"ಋ":12,"ಎ":13,"ಏ":14,"ಐ":15,"ಒ":16,"ಓ":17,"ಔ":18,"ಕ":19,"ಖ":20,"ಗ":21,"ಘ":22,"ಚ":23,"ಛ":24,"ಜ":25,"ಝ":26,"ಞ":27,"ಟ":28,"ಠ":29,"ಡ":30,"ಢ":31,"ಣ":32,"ತ":33,"ಥ":34,"ದ":35,"ಧ":36,"ನ":37,"ಪ":38,"ಫ":39,"ಬ":40,"ಭ":41,"ಮ":42,"ಯ":43,"ರ":44,"ಲ":45,"ಳ":46,"ವ":47,"ಶ":48,"ಷ":49,"ಸ":50,"ಹ":51,"ಾ":52,"ಿ":53,"ೀ":54,"ು":55,"ೂ":56,"ೃ":57,"ೆ":58,"ೇ":59,"ೈ":60,"ೊ":61,"ೋ":62,"ೌ":63,"್":64},"merges":[]}}